config/NASA_extendedPylon_v2_tas120_aoa0_900T33/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

//startFrom       latestTime;
startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   2000;

purgeWrite      0;

//writeFormat     ascii;
writeFormat     binary;

writePrecision   6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//#includeFunc CourantNo
//#includeFunc forceCoeffsCompressible
//#includeFunc staticPressure
//#includeFunc singleGraph
//#includeFunc probes
functions
{
    #includeFunc MachNo
    #includeFunc residuals
    #includeFunc cuttingPlane
    #includeFunc totalPressureCompressible 
}

// ************************************************************************* //
