config/NASA_extendedPylon_v2_tas120_aoa0_900T33/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//pOut            1e5;
pOut            9e4;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform $pOut;
    }

    wall
    {
        type            zeroGradient;
    }

    //pmsCanisterGroup
    //{
    //	type 		zeroGradient;
    //} 

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
