config/NASA_extendedPylon_v2_tas120_aoa0_900T33/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Tinlet          298;
Tinlet          306;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    wall
    {
        type            zeroGradient;
        //type            fixedValue;
	//wallValue	uniform $Tinlet;
	//value		$wallValue;
    }
    
    //pmsCanisterGroup
    //{
    //    type            zeroGradient;
    //}

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
