config/NASA_extendedPylon_v2_tas120_aoa0_900T33/system/forceCoeffsCompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is compressible (pressure is
    in units M/(LT^2), e.g. Pa).

\*---------------------------------------------------------------------------*/

patches     (freestream wall);

magUInf     20;
rhoInf      1.225;
lRef        1;
Aref        1;

liftDir     (4.6 5 5);
dragDir     (5.6 5 5);

CofR        (0 0 0);
pitchAxis   (0 1 0);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffs.cfg"

// ************************************************************************* //
