config/NASA_extendedPylon_v2_tas120_aoa0_900T33/system/staticPressure
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the pressure field in units M/(LT^2) (e.g. Pa) from kinematic
    pressure by scaling by a specified density.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/pressure/staticPressure.cfg"

rhoInf 1.2; // Density to scale

// ************************************************************************* //
